---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPreviewTaskNotFinished
source: html/1f96bbda-e3ba-31c1-0d2e-0aea00f436aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPreviewTaskNotFinished Property

Cannot create preview while background calculations are in progress.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementPreviewTaskNotFinished { get; }
```